Revit 2024 API
Field.ValueType Property
 The type of the values stored in the field.
Namespace: Autodesk.Revit.DB.ExtensibleStorage
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public Type ValueType { get; }
Visual Basic
Public ReadOnly Property ValueType As Type
	Get
Visual C++
public:
property Type^ ValueType {
	Type^ get ();
}
Remarks
 For key-value maps, this is the value type.
See Also
Field Class
Autodesk.Revit.DB.ExtensibleStorage Namespace